package dao;

/**----------------------------------------------------------------------*
 *■■■Sample4_02_1_Del_BusinessLogicクラス■■■
 *概要：ビジネスロジック（ユーザーの登録解除）
 *----------------------------------------------------------------------**/
public class Sample4_02_1_Del_BusinessLogic {

	/**----------------------------------------------------------------------*
	 *■unsubscribeメソッド
	 *概要　：対象のユーザーを登録解除する
	 *引数　：対象のユーザーID
	 *戻り値：なし
	 *----------------------------------------------------------------------**/
	public void unsubscribe (int targetUserId) {

		//-------------------------------------------
		//データベースへの接続を実施
		//-------------------------------------------

		//DAOクラスをインスタンス化＆指定のIDと合致するデータを削除するよう依頼
		Sample4_02_1_Common_DAO dao = new Sample4_02_1_Common_DAO();
		boolean result = dao.deleteMemberInfo(targetUserId);

		//終了メッセージを表示
		if(result){
			System.out.println("[INFO]削除処理が正常終了しました" ) ;
		}else{
			System.out.println("[INFO]削除処理に失敗しました" ) ;
		}

	}
}