package dao;

/**----------------------------------------------------------------------*
 *■■■Sample4_02_1_Ins_BusinessLogicクラス■■■
 *概要：ビジネスロジック（ユーザーの登録）
 *----------------------------------------------------------------------**/
public class Sample4_02_1_Ins_BusinessLogic {

	/**----------------------------------------------------------------------*
	 *■subscribeメソッド
	 *概要　：対象のユーザーを登録する
	 *引数　：対象のユーザーデータ（Sample4_02_1_Common_DTO型）
	 *戻り値：なし
	 *----------------------------------------------------------------------**/
	public void subscribe (Sample4_02_1_Common_DTO targetUserDto) {

		//-------------------------------------------
		//データベースへの接続を実施
		//-------------------------------------------

		//DAOクラスをインスタンス化＆対象のユーザーデータを登録するよう依頼
		Sample4_02_1_Common_DAO dao = new Sample4_02_1_Common_DAO();
		boolean result = dao.insertMemberInfo(targetUserDto);

		//終了メッセージを表示
		if(result){
			System.out.println("[INFO]登録処理が正常終了しました" ) ;
		}else{
			System.out.println("[INFO]登録処理に失敗しました" ) ;
		}
	}
}